axisymmetricJet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       29690;
    }
    front
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          15000;
        startFace       29700;
    }
    back
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          15000;
        startFace       44700;
    }
    atmosphere
    {
        type            patch;
        nFaces          360;
        startFace       59700;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          250;
        startFace       60060;
    }
)

// ************************************************************************* //
