axisymmetricJet/system/graph
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      ;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

graph
{
    type            sets;
    libs ("libsampling.so");
    writeControl   writeTime;

    interpolationScheme cellPointFace;

    setFormat       raw;

    sets
    (
        centreline
        {
            type    uniform;
            axis    x;
            start   ( 0  1e-6 0);
            end     (25  1e-6 0);
            nPoints 250;
        }
    );

    fields      ( U );
}

// ************************************************************************* //
